yukihamada/koe-device/firmware/sdkconfig.defaults
# Koe+Soluna v0.4.0 ESP-IDF SDK Config

# Target: ESP32-S3-MINI-1-N8R2 (8MB flash, 2MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"

# CPU: 240MHz dual core
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Flash 8MB
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# PSRAM有効 (ESP32-S3-MINI-1-N8R2: 2MB PSRAM搭載)
CONFIG_SPIRAM=y

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_CACHE_TX_BUF_NUM=16

# BLE (ペアリング用、NimBLE軽量スタック)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n

# TinyUSB無効
CONFIG_TINYUSB=n

# mDNS — Solunaデバイス発見
CONFIG_MDNS_ENABLED=y
CONFIG_MDNS_MAX_SERVICES=2

# LWIP — UDPマルチキャスト + SNTP
CONFIG_LWIP_IGMP=y
CONFIG_LWIP_SNTP_MAX_SERVERS=1

# I2S
CONFIG_SOC_I2S_NUM=2

# Power Management — Light Sleep対応
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_ESP_PM_DFS_INIT_AUTO=y

# Audio buffer (PSRAM)
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Compiler — サイズ最適化
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# スタック
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1024
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# HTTPS (mbedTLS)
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048

# Security (production用。開発時は無効)
# CONFIG_NVS_ENCRYPTION=y
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
# CONFIG_SECURE_BOOT=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# Partition table (factory + OTA)
CONFIG_PARTITION_TABLE_TWO_OTA=y
